<a href="https://colab.research.google.com/github/HumbertoMezaRuiz/FisicaComputacional1/blob/main/%5CActividad3%5CActividad3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [27]:
import numpy as np
import pandas as pd

url1 = "https://raw.githubusercontent.com/HumbertoMezaRuiz/FisicaComputacional1/main/Actividad1/diarios.txt"
encabezado = ['Fecha','Precipit','Evap','Tmax','Tmin']
df_dist = pd.read_csv(url1, names=encabezado, encoding='cp1251', sep='\s+', skiprows=19, skipfooter=2, header=None, engine='python')

In [32]:
print(df_dist.head(10))
print(df_dist.tail(10))

        Fecha Precipit  Evap Tmax Tmin
0  01/03/1973        0  Nulo   29   12
1  02/03/1973        0  Nulo   30   12
2  03/03/1973        0  Nulo   29    9
3  04/03/1973        0  Nulo   28    8
4  05/03/1973        0  Nulo   28    7
5  06/03/1973        0  Nulo   25    9
6  07/03/1973        0  Nulo   26    7
7  08/03/1973        0  Nulo   27    8
8  09/03/1973        0  Nulo   27   10
9  10/03/1973        0  Nulo   23    6
           Fecha Precipit  Evap Tmax Tmin
6888  21/03/2016        0  Nulo   39   11
6889  22/03/2016        0  Nulo   34   12
6890  23/03/2016        0  Nulo   31   12
6891  24/03/2016        0  Nulo   30   11
6892  25/03/2016        0  Nulo   31    9
6893  26/03/2016        0  Nulo   30   11
6894  27/03/2016        0  Nulo   30   11
6895  28/03/2016        0  Nulo   28   12
6896  29/03/2016        0  Nulo   28   11
6897  30/03/2016        0  Nulo   29   12

In [29]:
df_dist.shape

(6898, 5)

In [35]:
df_dist.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6898 entries, 0 to 6897
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Fecha     6898 non-null   object
 1   Precipit  6898 non-null   object
 2   Evap      6898 non-null   object
 3   Tmax      6898 non-null   object
 4   Tmin      6898 non-null   object
dtypes: object(5)
memory usage: 269.6+ KB

In [36]:
df_work0 = df_dist.copy()
df_work0.head()

        Fecha Precipit  Evap Tmax Tmin
0  01/03/1973        0  Nulo   29   12
1  02/03/1973        0  Nulo   30   12
2  03/03/1973        0  Nulo   29    9
3  04/03/1973        0  Nulo   28    8
4  05/03/1973        0  Nulo   28    7

In [37]:
str_Nulo = 'Nulo'
df_work1 = df_work0.replace(to_replace=str_Nulo, value='', regex=True)
df_work1.head()

        Fecha Precipit Evap Tmax Tmin
0  01/03/1973        0        29   12
1  02/03/1973        0        30   12
2  03/03/1973        0        29    9
3  04/03/1973        0        28    8
4  05/03/1973        0        28    7

In [38]:
df_work1.info()
print(df_work1.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6898 entries, 0 to 6897
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Fecha     6898 non-null   object
 1   Precipit  6898 non-null   object
 2   Evap      6898 non-null   object
 3   Tmax      6898 non-null   object
 4   Tmin      6898 non-null   object
dtypes: object(5)
memory usage: 269.6+ KB
        Fecha Precipit Evap Tmax Tmin
0  01/03/1973        0        29   12
1  02/03/1973        0        30   12
2  03/03/1973        0        29    9
3  04/03/1973        0        28    8
4  05/03/1973        0        28    7

In [41]:
# Deseamos convertir los valores de las variables ambientales a núm. flotantes 
cols_list = ['Precipit', 'Evap', 'Tmax', 'Tmin']
for cols in cols_list:
  df_work1[cols] = pd.to_numeric(df_work1[cols], errors='coerce')

df_work1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6898 entries, 0 to 6897
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Fecha     6898 non-null   object
 1   Precipit  6774 non-null   float64
 2   Evap      823 non-null    float64
 3   Tmax      6818 non-null   float64
 4   Tmin      6812 non-null   float64
dtypes: float64(4), object(1)
memory usage: 269.6+ KB

In [42]:
df_work1.isnull().sum()

Fecha          0
Precipit     124
Evap        6075
Tmax          80
Tmin          86
dtype: int64

In [43]:
print(df_work0.head())
print(df_work1.head())

        Fecha Precipit  Evap Tmax Tmin
0  01/03/1973        0  Nulo   29   12
1  02/03/1973        0  Nulo   30   12
2  03/03/1973        0  Nulo   29    9
3  04/03/1973        0  Nulo   28    8
4  05/03/1973        0  Nulo   28    7
        Fecha  Precipit  Evap  Tmax  Tmin
0  01/03/1973       0.0   NaN  29.0  12.0
1  02/03/1973       0.0   NaN  30.0  12.0
2  03/03/1973       0.0   NaN  29.0   9.0
3  04/03/1973       0.0   NaN  28.0   8.0
4  05/03/1973       0.0   NaN  28.0   7.0

In [44]:
df_work1.describe().round(2)

       Precipit    Evap     Tmax     Tmin
count   6774.00  823.00  6818.00  6812.00
mean       0.58    8.48    32.75    15.11
std        4.68    3.20     5.85     6.72
min        0.00    0.10     6.00    -1.00
25%        0.00    6.10    28.00    10.00
50%        0.00    8.60    34.00    14.00
75%        0.00   10.70    38.00    22.00
max      180.00   17.90    46.00    31.00

In [45]:
print(df_work1.head())
print(df_work1.tail())

        Fecha  Precipit  Evap  Tmax  Tmin
0  01/03/1973       0.0   NaN  29.0  12.0
1  02/03/1973       0.0   NaN  30.0  12.0
2  03/03/1973       0.0   NaN  29.0   9.0
3  04/03/1973       0.0   NaN  28.0   8.0
4  05/03/1973       0.0   NaN  28.0   7.0
           Fecha  Precipit  Evap  Tmax  Tmin
6893  26/03/2016       0.0   NaN  30.0  11.0
6894  27/03/2016       0.0   NaN  30.0  11.0
6895  28/03/2016       0.0   NaN  28.0  12.0
6896  29/03/2016       0.0   NaN  28.0  11.0
6897  30/03/2016       0.0   NaN  29.0  12.0

In [47]:
df_work1.describe()

          Precipit        Evap         Tmax        Tmin
count  6774.000000  823.000000  6818.000000  6812.00000
mean      0.583776    8.477521    32.752728    15.11377
std       4.675694    3.196214     5.852063     6.72071
min       0.000000    0.100000     6.000000    -1.00000
25%       0.000000    6.100000    28.000000    10.00000
50%       0.000000    8.600000    34.000000    14.00000
75%       0.000000   10.700000    38.000000    22.00000
max     180.000000   17.900000    46.000000    31.00000